// // let str = "Hello okten";
// // console.log(str[0])
// // for (const strElement of str) {
// //     console.log(strElement)
// // }
//
//
//
// // let s = new String("hjgjg");
// // console.log(typeof s);
//
//
// // let str = "Hello okten";
// // console.log(str.concat(" !!!")); // добвляет стрингу к стринге, оставляя первоначальный обьект неизменным
// // console.log(str);
//
//
// // let str = "Hello okten";
// // console.log(str.toUpperCase()); //переводит все буквы в капслок, те что уже были большими не изменятся оставляя первоначальный обьект неизменным
// // console.log(str);
//
// //
// // let str = "Hello okten";
// // console.log(str.toLocaleLowerCase());//переводит все буквы в нижний регистр, те что уже біли в нем не изменятся оставляя первоначальный обьект неизменным
// // console.log(str);
//
// // let str = "Hello okten";
// // console.log(str.startsWith("Hell")); // если стринга начинается с указанной сиквенции символов, то этот метод возвращает true, если нет - то false
//
// // let str = "Hello okten";
// // console.log(str.endsWith("o okten")); // если стринга заканчивается с указанной сиквенции символов, то этот метод возвращает true, если нет - то false
//
//
// // let str = "Hello okten";
// // console.log(str.substring(0,4));// обрезает стрингу с первого указанного индекса по второй указанный инедкс НЕ включая второй указанный индекс - обрезается все кроме указанного диапазона - В этом примере получим Hell. Если ввести доин индекс - обрежет все что стоит перед ним, если ввести ноль скопирует всю стрингу
//
// // let str = "Hello okten";
// // console.log(str.indexOf("l")); //показывает номер индекса указанной буквы, только первое вхождение - номер первого индекса где встретилась такая буква
//
// // let str = "Hello okten";
// // console.log(str.lastIndexOf("o")); //показывает номер индекса указанной буквы, но перебирать стрингу начинает с конца. Показывает номер индекса первого вхождения этой буквы, но перебор с конца (номера индексов как всегда - справа на лево)
//
// // let str = "Hello okten";
// // console.log(str.indexOf("o",5));// ищет номер индекса с вхождением указанной буквы, искать начинает с указанного индекса. Если в нем такая буква, то его номер и покажет.
//
// //
// // let str = "Hello okten";
// // console.log(str.charAt(10)); //возвращает букву, которая находится в этом номере индекса
//
//
// // let str = "Hellok okten";
// // console.log(str.replace("k", "OL")); //заменяет значение указанное в первом операнде, на значене указанное во втором опернде ТОЛЬКО один раз - первый встреченный в стринге, чтобы заменить все встречающиеся в стринге такие значения используется метод replaceALL. Так же можно указывать не один символ, а сиквенцию символов
// // console.log(str.replaceAll("k", "OL"));
// // console.log(str.replaceAll("ok", "**"));
//
// // let str = "Hello okten";
// // console.log(str.split(" ")); //возвращает массив разделяя стрингу по указанному значению. Элементы амссива - те кусочки стринги которые разделились. Сам указанный элемент в массив не попадает, он вырезается.
// // console.log(str.split("o"));
//

let s = "   gfghgh    fgf";
let s1 = s.trim()// удаляет лишние пробелы из грязной стринги
console.log(s1);
console.log(s.length);
console.log(s1.length);


//
// //-----------------------array--------------------------------------------------------------------------------
//
// let arr = [];
// console.log(Array.isArray(arr));// отдает тру если обьект является массивом и фелс если нет
//
// arr[arr.length] = 1;
// arr[arr.length] = 2;
// console.log(arr);
// arr.push("new element1");// добавляет элемент массива в конец массива - применяя методы к массиву мы получаем измепнения в данном массиве, а НЕ получаем новый обновленный иассив
// arr.push("new element2");
// arr.push("new element3");
// arr.push("new element4");
// arr.push("new element5");
//
//
// console.log(arr.pop());
// console.log(arr);
// arr.pop();// вырезает последний элемент массива ПРИЧЕМ можно куда-то передать удаленный элемент при использовании метода pop
// console.log(arr);
//
//
// arr.unshift("!!!!"); //доьавляет элемент в начало массива
// console.log(arr.unshift("!!!!")); //сама функция если ее вывести возвращает длину полученного массива
// console.log(arr);
//
// arr.shift();
// console.log(arr); //удаляет элемент с начала массива
// console.log(arr.shift());// сама функция возвращает значение удаленного элемента
//
// let joinAarr = arr.join("; ");//обьедитняет вс е элементы массива, если не будет указан раделяющий знак, то все будут разделяться запятой
// console.log(joinAarr);
//
// let numbs = [1,2,3,4,5];
// let arr2 = [7,8,9];
// let joinArrs = numbs.concat(arr2, arr);//обьединяет два и больше массивов - первым указываем какой идет первым, в операнде следующий, следующий и тд. Начальные массивы при этом не меняются
// console.log(joinArrs);
//
//
//
// let arrRevers = arr2.reverse();// делает реверс массива - ИЗМЕНЯЕТ изначальный массив
// console.log(arr2);
//
//
// console.log(joinArrs);
// let slice =  joinArrs.slice(0,3); //Вырезает кусок массива по указанным индексам - с первого указанного по последний НЕ включая последний указанный индекс, изначальный массив НЕ меняется
// console.log(joinArrs);
// console.log(slice);
//
// console.log(" ")
// console.log(joinArrs)
// let splice = joinArrs.splice(0,4, "hjj");//вырезает кусок массива с первого указанного индекса - если в скобках просто 0 - скопирует массив, вторая цифра показывает сколько элементов от первог указанного индекса нужно вырезать. Функция возвращает вырезанный кусок, первоначальный массив МЕНЯЕТСЯ, в нем нет вырезанного куска. после второй цифры можно указать через запятую любое количество элементов - их знаения, котгорые добавятся в массив вместо вырезанного куска
// console.log(splice);
// console.log(joinArrs);
// console.log(" ")
//
//
// console.log(joinArrs.indexOf("new element1"));//находим номер индекса элемента массива со значением "new element1" - в этом случае 7.
// joinArrs.splice(joinArrs.indexOf("new element1"),1);//вырезаем элемент из массива по номеру индекса - номер находим по значению индексофом. То есть удаляем конкретный элемент из массива
// console.log(joinArrs);
// console.log("")
//
// console.log(joinArrs.includes("hjj"));// возвращает тру если массив содержит такой єлемент, и фолс если не содержит. Так же работает со стрингой.
// console.log("")


// --------------------------------------------Функції масивів з колбеками--------------------
//
// users = [
//     {
//         id:1,
//         name: "Nica",
//         age: 18,
//         status: true
//     },
//
//     {
//         id:2,
//         name: "Lica",
//         age: 27,
//         status: false
//     },
//
//     {
//         id: 3,
//         name: "Ivan",
//         age: 35,
//         status: true
//     },
//
//     {
//         id: 4,
//         name: "Vika",
//         age: 47,
//         status: false
//     },
//
//     {
//         id: 5,
//         name: "Petya",
//         age: 45,
//         status: true
//     },
// ]

// users.forEach(function (value, index, array) {
//     // console.log(value);
//     // console.log(index);
//     // console.log(array);
// })

// users.forEach(value => console.log(value));// перебирает массив по элементам. Задаем аргументом (произвольное название) каждый элемент массива, а метод вкладывает в него значение каждого элемента. Потом можно работать с ними как угодно Также как аргументи можно ввести индекс элемента и сам массив
//
// users.forEach((value, index) => console.log(index,value)) ;
//
//
//
//
// users.filter(value => console.log(value.age > 30));// возвращает тру или фєлс,
//
// let filter = users.filter(value => value.age > 30);//  создает массив из выбранных обьектов
// console.log(filter);// изначальный массив остается неизмененным
//
//
// let newusers = users.map(function (value, index){//метод мєп создает новый массив на основе элементов массива
// выполняя функцию внутри себя
//     let newuser = {
//         id: value.id,
//         name: value.name,
//         age: value.age,
//         status: value.status,
//         Number: index+1
//     }
// return newuser
// });
// console.log(newusers);
//
// let newusers1 = users.map(function(value,index)
// {
//     return {...value, number: index+1};
//
//     }
// )
// console.log(newusers1);
//
//
// let newusers2 = users.map((value,index) => {
// //     return{
// //         id: value.id,
// //         name: value.name,
// //         age: value.age,
// //         status: value.status,
// //         Number: index+1
//     }
// })
// console.log(newusers2);


// let find = users.find(value => value.name === "Nica"); // возвращает ТОЛЬКО ПЕРВЫЙ элемент массива с найденными параметрами
// console.log(find);
//
// let arrNumbers = [1,2,3,4,5];
// let arrNumber3 =arrNumbers.find(value => value>3);
// console.log(arrNumber3);


//
// console.log(users.every(value => value.status ));// проверяет все ли указанные части имеют татус true, если да - то на выходе тру, если хоть один фелс - то на выходе фелс.
//
// let arrNumbers = [1,2,3,4,5];
// console.log(arrNumbers.every(value => value));
//
//
// console.log(arrNumbers.some(value => value));//если хоть один указанный элемент имеет тру - то метод отдает тру.


// users = [
//     {id:2, name: "Lica", age: 27, status: false},
//     {id:1, name: "Nica", age: 18, status: true},
//     {id: 3, name: "Ivan", age: 35, status: true},
//     {id: 4, name: "Vika", age: 47, status: false},
//     {id: 5, name: "Petya", age: 45, status: true},
// ]

// users.sort();
// console.log(users);

// let arr = [11,8,10,2];
// arr.sort();// метод сорт МЕНЯЕТ изначальный массив отсортировывая его, если аргументы функции не указаны, то сортирует лексикографически Числа преобразуются в строки Сравнение идёт как "10" < "2"📌 Поэтому для чисел всегда нужен compareFunction
//
//
// console.log(arr);
//
// arr.sort((a, b) => a - b);
// console.log(arr);
// let sort = users.sort((us1,  us2)=>us1.age-us2.age);
// console.log(users);
// console.log(sort);
//
// users.sort((a,b) =>{//сортировка по алфавиту. (юникодам) Если нужно по друому алфавиту   localeCompare("uk")
//     -
//
//     if (a.name>b.name){
//         return 1;
//     }if (a.name<b.name){
//         return -1;
//     }if (a.name === b.name){
//         return 0;
//     }
// })
//
// console.log(users);

//
// users = [
//     {id:2, name: "Lica", age: 27, status: false},
//     {id:1, name: "Nica", age: 18, status: true},
//     {id: 3, name: "Ivan", age: 47, status: true},
//     {id: 4, name: "Vika", age: 47, status: false},
//     {id: 5, name: "Petya", age: 47, status: true},
// ]

// let newW = users.reduce((accum, user)=>{
//      accum.push(user.name);
//      return accum;
// },[]);
// console.log(newW);
// console.log(users);
//
// const maxAge = users.reduce((acc, user) => {
//     if (user.age > acc) {
//         return user.age;   // нашли новый максимум
//     } else {
//         return acc;        // максимум остаётся прежним
//     }
// }, 0);
//
// console.log(maxAge);

// const maxAge = users.reduce((acc, user) => {
//     if (user.age > acc.age) {
//         return user;
//     } else {
//         return acc;
//     }
//
// }, users[0]);
//
// console.log(maxAge);

//
// const maxAges = users.reduce((acc, user) =>{// редьюс имеет оператор - комирку куда склажіваются что-то и текущее значение итерации
//    if (acc.length === 0){
//        acc.push(user);
//        return acc;
//    } if (acc[0].age<user.age){
//        acc = [user];
//        return acc;
//     } if (acc[0].age === user.age){
//        acc.push(user);
//        return acc;
//     }
//    return acc;
// },[])
//
// console.log(maxAges);



users = [
    {id:2, name: "Lica", age: 27, status: false},
    {id:1, name: "Nica", age: 18, status: true},
    {id: 3, name: "Ivan", age: 47, status: true},
    {id: 4, name: "Vika", age: 47, status: false},
    {id: 5, name: "Petya", age: 47, status: true},
]


// const Min = arr.reduce((acc, item) => {
//     if (acc<item){
//         return acc;
//     } if (acc>=item){
//         return acc = item;
//     }
// })
// console.log(Min);

// let arr = [80,1,20,-20];
// const arrMinsMax = arr.reduce((acc, item) =>{
// if (item<acc[0].min){
//     acc[0].min = item;
// }
// return acc;
// },[{min:Infinity}])
// console.log(arrMinsMax);
//
//
// let arr1 = [80, 1, 20, -20];
//
// const result = arr.reduce((acc, value) => {
//     if (value < acc.min) {
//         acc.min = value;
//     }
//     return acc;
// }, { min: Infinity });
//
// console.log([result]);


//раскладываем юзеров со статусом фелс и тру в обьект у котрого в ключах лежат массивы
// let reduce = users.reduce((acc, user) => {
//     if (user.status){
//         acc.statusT.push(user);
//     } else {
//         acc.statusF.push(user);
//     }
//     return acc;
// },{statusF:[], statusT:[]})
//
// console.log(reduce);